import { splitStringIntoCharacters } from "@Toolbox/String";
import { Font } from "./Font";
import terminus0 from "./terminus6x12_0.png";
import terminus1 from "./terminus6x12_1.png";
import terminusCustom from "./terminus6x12_custom.png";
import { type charArray } from "../types";

/* cSpell:disable */

// 32 characters wide, 32 characters high
const terminus6x12Page0ValueMap: charArray[] = [
  "\u0000 !\"#$%&'()*+,-./0123456789:;<=>",
  "?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^",
  "_`abcdefghijklmnopqrstuvwxyz{|}~",
  " ¡¢£¤¥¦§¨©ª«¬\u00AD®¯°±²³´µ¶·¸¹º»¼½¾¿",
  "ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß",
  "àáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ",
  "ĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğ",
  "ĠġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿ",
  "ŀŁłŃńŅņŇňŉŊŋŌōŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞş",
  "ŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹźŻżŽžſ",
  "ƆƎƏƐƒƝƞƵƶƷǍǎǏǐǑǒǓǔǢǣǤǥǦǧǨǩǪǫǬǭǮǯ",
  "ǰǴǵǼǽǾǿȘșȚțȲȳȷɔɘəɛɲʒʻʼʽˆˇ˘˙˛˜˝\u0300\u0301",
  "\u0302\u0303\u0304\u0305\u0306\u0307\u0308\u030A\u030B\u030C\u0329΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚ",
  "ΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλ",
  "μνξοπρςστυφχψωϊϋόύώϑϕϰϱϲϳϴϵ϶ЀЁЂЃ",
  "ЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУ",
  "ФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрсту",
  "фхцчшщъыьэюяѐёђѓєѕіїјљњћќѝўџѢѣѪѫ",
  "ҐґҒғҔҕҖҗҘҙҚқҜҝҠҡҢңҤҥҪҫҮүҰұҲҳҶҷҸҹ",
  "ҺһӀӁӂӏӐӑӒӓӔӕӖӗӘәӚӛӜӝӞӟӢӣӤӥӦӧӨөӪӫ",
  "ӬӭӮӯӰӱӲӳӴӵӸӹאבגדהוזחטיךכלםמןנסעף",
  "פץצקרשתḌḍḴḵḶḷṀṁṂṃṄṅṆṇṬṭẸẹẼẽỊịỌọỤ",
  "ụỸỹ           \u200B\u200C\u200D\u200E\u200F‐‑‒–—―‖‗‘’‚‛“",
  "”„‟†‡•…‰′″‹›‼‾⁰ⁱ⁴⁵⁶⁷⁸⁹⁺⁻⁼⁽⁾ⁿ₀₁₂₃",
  "₄₅₆₇₈₉₊₋₌₍₎ₐₑₒₓₔₕₖₗₘₚ₧₪€₮ℂℎℏℕ№ℚℝ",
  "™ℤΩℵ←↑→↓↔↕↤↦↨↲↳↵↻⇋⇌⇐⇑⇒⇓⇔⇕∀∃∄∅∆∇∈",
  "∉∊∋∌∍−∓∔∕∖∙√∞∟∥∧∨∩∪≈≠≡≤≥≪≫⊂⊃⊆⊇⊥⋂",
  "⋃⌀⌂⌈⌉⌊⌋⌐⌙⌠⌡⎛⎜⎝⎞⎟⎠⎡⎢⎣⎤⎥⎦⎧⎨⎩⎫⎬⎭⎮⎯⎺",
  "⎻⎼⎽⏐␉␊␋␌␍␤─━│┃┈┉┊┋┌┍┎┏┐┑┒┓└┕┖┗┘┙",
  "┚┛├┝┞┟┠┡┢┣┤┥┦┧┨┩┪┫┬┭┮┯┰┱┲┳┴┵┶┷┸┹",
  "┺┻┼┽┾┿╀╁╂╃╄╅╆╇╈╉╊╋═║╒╓╔╕╖╗╘╙╚╛╜╝",
  "╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬╭╮╯╰╱╲╳╴╵╶╷╸╹╺╻╼╽",
].map((l) => splitStringIntoCharacters(l));

// 32 characters wide, 32 characters high
const terminus6x12Page1ValueMap: charArray[] = [
  "╾╿▀▁▂▃▄▅▆▇█▉▊▋▌▍▎▏▐░▒▓▖▗▘▙▚▛▜▝▞▟",
  "■▬▮▲▶►▼◀◄◆◊○●◘◙☺☻☼♀♂♠♣♥♦♪♫✓✔✗✘⟨⟩",
  "⟪⟫⠀⠁⠂⠃⠄⠅⠆⠇⠈⠉⠊⠋⠌⠍⠎⠏⠐⠑⠒⠓⠔⠕⠖⠗⠘⠙⠚⠛⠜⠝",
  "⠞⠟⠠⠡⠢⠣⠤⠥⠦⠧⠨⠩⠪⠫⠬⠭⠮⠯⠰⠱⠲⠳⠴⠵⠶⠷⠸⠹⠺⠻⠼⠽",
  "⠾⠿⡀⡁⡂⡃⡄⡅⡆⡇⡈⡉⡊⡋⡌⡍⡎⡏⡐⡑⡒⡓⡔⡕⡖⡗⡘⡙⡚⡛⡜⡝",
  "⡞⡟⡠⡡⡢⡣⡤⡥⡦⡧⡨⡩⡪⡫⡬⡭⡮⡯⡰⡱⡲⡳⡴⡵⡶⡷⡸⡹⡺⡻⡼⡽",
  "⡾⡿⢀⢁⢂⢃⢄⢅⢆⢇⢈⢉⢊⢋⢌⢍⢎⢏⢐⢑⢒⢓⢔⢕⢖⢗⢘⢙⢚⢛⢜⢝",
  "⢞⢟⢠⢡⢢⢣⢤⢥⢦⢧⢨⢩⢪⢫⢬⢭⢮⢯⢰⢱⢲⢳⢴⢵⢶⢷⢸⢹⢺⢻⢼⢽",
  "⢾⢿⣀⣁⣂⣃⣄⣅⣆⣇⣈⣉⣊⣋⣌⣍⣎⣏⣐⣑⣒⣓⣔⣕⣖⣗⣘⣙⣚⣛⣜⣝",
  "⣞⣟⣠⣡⣢⣣⣤⣥⣦⣧⣨⣩⣪⣫⣬⣭⣮⣯⣰⣱⣲⣳⣴⣵⣶⣷⣸⣹⣺⣻⣼⣽",
  "⣾⣿⸬�",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
].map((l) => splitStringIntoCharacters(l));

/* cSpell:enable */

export const terminus6x12 = new Font(6, 12);

export const loadTerminus6x12 = async () => {
  await terminus6x12.loadAtlas(
    "terminus0",
    terminus0,
    terminus6x12Page0ValueMap,
  );
  await terminus6x12.loadAtlas(
    "terminus1",
    terminus1,
    terminus6x12Page1ValueMap,
  );
  await terminus6x12.loadAtlas("terminusCustom", terminusCustom, [
    [
      "penger00",
      "penger01",
      "penger02",
      "pengDollar",
      "floppy0",
      "floppy1",
      "floppyDrive0",
      "floppyDrive1",
      "hardDrive0",
      "hardDrive1",
      "",
      "",
      "",
      "",
      "",
      "",
    ],
    [
      "penger10",
      "penger11",
      "penger12",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
    ],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
  ]);
};
