import { splitStringIntoCharacters } from "@Toolbox/String";
import { Font } from "./Font";
import cp437 from "./vga9x8.png";
import cp437custom from "./vga9x8_custom.png";
import { type charArray } from "../types";

/* cSpell:disable */

export const vgaPlusCharacterValueMap: charArray[] = [
  " !\"#$%&'()*+,-./",
  "0123456789:;<=>?",
  "@ABCDEFGHIJKLMNO",
  "PQRSTUVWXYZ[\\]^_",
  "`abcdefghijklmno",
  "pqrstuvwxyz{|}~⌂",
  " ¡¢£¤¥¦§¨©ª«¬-®¯",
  "°±²³´µ¶·¸¹º»¼½¾¿",
  "ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ",
  "ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß",
  "àáâãäåæçèéêëìíîï",
  "ðñòóôõö÷øùúûüýþÿ",
  "ĀāĂăĄąĆćĈĉĊċČčĎď",
  "ĐđĒēĔĕĖėĘęĚěĜĝĞğ",
  "ĠġĢģĤĥĦħĨĩĪīĬĭĮį",
  "İıĲĳĴĵĶķĸĹĺĻļĽľĿ",
  "ŀŁłŃńŅņŇňŉŊŋŌōŎŏ",
  "ŐőŒœŔŕŖŗŘřŚśŜŝŞş",
  "ŠšŢţŤťŦŧŨũŪūŬŭŮů",
  "ŰűŲųŴŵŶŷŸŹźŻżŽžſ",
  "ƒơƷǺǻǼǽǾǿȘșȚțɑɸˆ",
  "ˇˉ˘˙˚˛˜˝;΄΅Ά·ΈΉΊ",
  "ΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜ",
  "ΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέ",
  "ήίΰαβγδεζηθικλμν",
  "ξοπρςστυφχψωϊϋόύ",
  "ώϐϴЀЁЂЃЄЅІЇЈЉЊЋЌ",
  "ЍЎЏАБВГДЕЖЗИЙКЛМ",
  "НОПРСТУФХЦЧШЩЪЫЬ",
  "ЭЮЯабвгдежзийклм",
  "нопрстуфхцчшщъыь",
  "эюяѐёђѓєѕіїјљњћќ",
  "ѝўџҐґ           ",
  "                ",
  "      ᴛᴦᴨẀẁẂẃẄẅẟ",
  "Ỳỳ‐‒–—―‗‘’‚‛“”„‟",
  "†‡•…‧‰′″‵‹›‼‾‿⁀⁄",
  "⁔⁴⁵⁶⁷⁸⁹⁺⁻ⁿ₁₂₃₄₅₆",
  "₇₈₉₊₋₣₤₧₪€℅ℓ№™Ω℮",
  "⅐⅑⅓⅔⅕⅖⅗⅘⅙⅚⅛⅜⅝⅞←↑",
  "→↓↔↕↨∂∅∆∈∏∑−∕∙√∞",
  "∟∩∫≈≠≡≤≥⊙⌀⌂⌐⌠⌡─│",
  "┌┐└┘├┤┬┴┼═║╒╓╔╕╖",
  "╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦",
  "╧╨╩╪╫╬▀▁▄█▌▐░▒▓■",
  "□▪▫▬▲►▼◄◊○●◘◙◦☺︎☻",
  "☼♀︎♂︎♠︎♣︎♥︎♦︎♪♫✓ﬁﬂ�",
].map((l) => splitStringIntoCharacters(l));

/* cSpell:enable */

export const vgaPatternsCharacterValueMap: charArray[] = ["░", "▒", "▓"].map(
  (l) => splitStringIntoCharacters(l),
);

export const vga9x8 = new Font(9, 8, "░▒▓");

export const loadVga9x8 = async () => {
  // await font9x8.loadAtlas(
  //   "cp437patterns",
  //   cp437patterns,
  //   cp437patternsCharacterValueMap,
  //   2,
  //   5,
  // );
  await vga9x8.loadAtlas("cp437plus", cp437, vgaPlusCharacterValueMap);
  await vga9x8.loadAtlas("cp437custom", cp437custom, [
    [
      "penger00",
      "penger01",
      "penger02",
      "pengDollar",
      "floppy0",
      "floppy1",
      "floppyDrive0",
      "floppyDrive1",
      "hardDrive0",
      "hardDrive1",
      "",
      "",
      "",
      "",
      "",
      "",
    ],
    [
      "penger10",
      "penger11",
      "penger12",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
    ],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
    ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
  ]);
};
